string x1 = "Комсомольцы трудились день и ночь, не покладая рук, не вставая с постели. \nЛетом, мы с пацанами ходили в поход с ночевкой, и с собой взяли только необходимое. Картошку, палатку и Марию Ивановну. \nУмер М. Ю. Лермонтов на Кавказе, но любил он его не поэтому! \nПлюшкин навалил у себя в углу целую кучу и каждый день туда подкладывал. \nЛенский вышел на дуэль в панталонах. Они разошлись и раздался выстрел. \nДантес не стоил выеденного яйца Пушкина \nВо двор въехали две лошади. Это были сыновья Тараса Бульбы. \nОнегину нравился Байрон, поэтому он и повесил его над кроватью. \nГерасим поставил на пол блюдечко, и стал тыкать в него мордочкой. \nУ Онегина было тяжело внутри, и он пришел к Татьяне облегчиться. \nАндрей Болконский часто ездил поглядеть тот дуб, на который он был похож как две капли воды. \nЛермонтов родился у бабушки в деревне, когда его родители жили в Петербурге. \nГерасим налил Муме щей. \nБедная Лиза рвала цветы и этим кормила свою мать. \nХлестаков сел в бричку и крикнул: \"Гони, голубчик, в аэропорт! \" \nОтец Чацкого умер в детстве. \nВдруг Герман услыхал скрип рессор. Это была старая княгиня. \nУ Ростовых было три дочери: Наташа, Соня и Николай. \nИз всех женских прелестей у Марии Болконской были только глаза. \nТарас сел на коня. Конь согнулся, а потом засмеялся. \nДуша Татьяны полна любви и ждёт не дождётся, как бы обдать ею кого-нибудь. \nШел полк французов и кутузов. \nОнегин был богатый человек: по утрам он сидел в уборной, а потом ехал в цирк. \nПетр Первый соскочил с пьедестала и побежал за Евгением, громко цокая копытами. \nНос Гоголя наполнен глубочайшим содержанием. \nГлухонемой Герасим не любил сплетен и говорил только правду. \nТургенева не удовлетворяют ни отцы, ни дети. \nТакие девушки, как Ольга, уже давно надоели Онегину, да и Пушкину тоже. \nС Михаилом Юрьевичем Лермонтовым я познакомилась в детском саду. \nГерасим ел за четверых, а работал один. \nБазаров любил разных насекомых и делал им прививки. \nПугачев пожаловал шубу и лошадь со своего плеча. \nУ Чичикова много положительных черт: он всегда выбрит и пахнет. \nБазаров умер молодым человеком и сбыча его мечт не произошла. \nСыновья приехали к Тарасу и стали с ним знакомиться. \nЧичиков ехал в карете с поднятым задом. \nПо дороге в Богучарово Андрей Болконский, как старый дуб, расцвел и зазеленел. \nФамусов осуждает свою дочь за то, что Софья с самого утра и уже с мужчиной. \nНаташа была истинно русской натурой, очень любила природу и часто ходила на двор. \nГерасим бросил Татьяну и связался с Муму. \nГрушницкий тщательно целил в лоб, пуля оцарапала колено. \nПоэты XIX века были легкоранимыми людьми: их часто убивали на дуэлях. \nЗдесь он впервые узнал разговорную русскую речь от няни Арины Родионовны. \nПервые успехи Пьера Безухова в любви были плохие - он сразу женился. \nВ результате из Тихона вырос не мужчина, а самый настоящий овца. \nЯзык у Базарова был тупой, но потом заострился в спорах. \nМне нравится то, что с таким талантом Пушкин не побоялся стать народным поэтом. \nТроекуров был хотя не глуп, но немного с приветом. \nТак как Печорин - человек лишний, то и писать о нем - лишняя трата времени.";
string x2 = "Комсомольцы трудились день и ночь, не покладая рук, не вставая с постели. \r\nЛетом, мы с пацанами ходили в поход с ночевкой, и с собой взяли только необходимое. Картошку, палатку и Марию Ивановну. \r\nУмер М. Ю. Лермонтов на Кавказе, но любил он его не поэтому! \r\nПлюшкин навалил у себя в углу целую кучу и каждый день туда подкладывал. \r\nЛенский вышел на дуэль в панталонах. Они разошлись и раздался выстрел. \r\nДантес не стоил выеденного яйца Пушкина \r\nВо двор въехали две лошади. Это были сыновья Тараса Бульбы. \r\nОнегину нравился Байрон, поэтому он и повесил его над кроватью. \r\nГерасим поставил на пол блюдечко, и стал тыкать в него мордочкой. \r\nУ Онегина было тяжело внутри, и он пришел к Татьяне облегчиться. \r\nАндрей Болконский часто ездил поглядеть тот дуб, на который он был похож как две капли воды. \r\nЛермонтов родился у бабушки в деревне, когда его родители жили в Петербурге. \r\nГерасим налил Муме щей. \r\nБедная Лиза рвала цветы и этим кормила свою мать. \r\nХлестаков сел в бричку и крикнул: \"Гони, голубчик, в аэропорт! \" \r\nОтец Чацкого умер в детстве. \r\nВдруг Герман услыхал скрип рессор. Это была старая княгиня. \r\nУ Ростовых было три дочери: Наташа, Соня и Николай. \r\nИз всех женских прелестей у Марии Болконской были только глаза. \r\nТарас сел на коня. Конь согнулся, а потом засмеялся. \r\nДуша Татьяны полна любви и ждёт не дождётся, как бы обдать ею кого-нибудь. \r\nШел полк французов и кутузов. \r\nОнегин был богатый человек: по утрам он сидел в уборной, а потом ехал в цирк. \r\nПетр Первый соскочил с пьедестала и побежал за Евгением, громко цокая копытами. \r\nНос Гоголя наполнен глубочайшим содержанием. \r\nГлухонемой Герасим не любил сплетен и говорил только правду. \r\nТургенева не удовлетворяют ни отцы, ни дети. \r\nТакие девушки, как Ольга, уже давно надоели Онегину, да и Пушкину тоже. \r\nС Михаилом Юрьевичем Лермонтовым я познакомилась в детском саду. \r\nГерасим ел за четверых, а работал один. \r\nБазаров любил разных насекомых и делал им прививки. \r\nПугачев пожаловал шубу и лошадь со своего плеча. \r\nУ Чичикова много положительных черт: он всегда выбрит и пахнет. \r\nБазаров умер молодым человеком и сбыча его мечт не произошла. \r\nСыновья приехали к Тарасу и стали с ним знакомиться. \r\nЧичиков ехал в карете с поднятым задом. \r\nПо дороге в Богучарово Андрей Болконский, как старый дуб, расцвел и зазеленел. \r\nФамусов осуждает свою дочь за то, что Софья с самого утра и уже с мужчиной. \r\nНаташа была истинно русской натурой, очень любила природу и часто ходила на двор. \r\nГерасим бросил Татьяну и связался с Муму. \r\nГрушницкий тщательно целил в лоб, пуля оцарапала колено. \r\nПоэты XIX века были легкоранимыми людьми: их часто убивали на дуэлях. \r\nЗдесь он впервые узнал разговорную русскую речь от няни Арины Родионовны. \r\nПервые успехи Пьера Безухова в любви были плохие - он сразу женился. \r\nВ результате из Тихона вырос не мужчина, а самый настоящий овца. \r\nЯзык у Базарова был тупой, но потом заострился в спорах. \r\nМне нравится то, что с таким талантом Пушкин не побоялся стать народным поэтом. \r\nТроекуров был хотя не глуп, но немного с приветом. \r\nТак как Печорин - человек лишний, то и писать о нем - лишняя трата времени.";

Console.WriteLine("Введите текст:");
string text = Console.ReadLine();
string menu = "0";
List<string> save = new List<string> { };
if (text.Length < 100)
{
    Console.WriteLine("Ошибка: строка короче 100 символов");
}
else
{
    do
    {
        Console.WriteLine("----------------------------------------");
        Console.WriteLine("1 - Статистика (подсчёт слов и предложений, кратчайшее и длиннейшее слово,");
        Console.WriteLine("    подсчёт гласных и согласных, статистика по частоте букв)");
        Console.WriteLine("2 - Ввод нового текста");
        Console.WriteLine("3 - Продолжить работу с текстом");
        Console.WriteLine("4 - Сохранение статистики в список");
        Console.WriteLine("5 - Вывод статистики по прошлым текстам");
        Console.WriteLine("0 - Выход");
        Console.WriteLine("----------------------------------------");
        menu = Console.ReadLine();

        switch (menu)
        {
            case "1": Console.Write(statistika(text)); break;
            case "2": text = text_new(text); break;
            case "3": text = text_continue(text); break;
            case "4": save_stat(save, text); break;
            case "5": print_stat(save); break;
            case "0": break;
            default: continue;
        }
    } while (menu != "0");
}
// функции, связанные со статистикой
string count_words(string s) // подсчёт слов
{ 
    int t_words = 0;
    char prev = ' '; 
    foreach (char c in s)
    {
        if (c == ' ') { t_words++; }
        if (prev == '-') { t_words--; }
        prev = c;
    }
    return $"Общее количество слов: {t_words}\n";
}
string shortest_word(string s) // кратчайшее слово
{
    string res = "00000000000000000000000000000000000000000000000000000000";
    string temp = "";
    string PUNCTUATION = "-,.!\"\'\n ";

    foreach (char c in s)
    {
        if (PUNCTUATION.Contains(c))
        {
            if (temp.Length < res.Length)
            {
                res = temp;
                temp = "";
            }
        }
        else { temp += c; }
    }
    return $"Самое короткое слово: {res} \n";
}
string count_sentence(string s) // подсчёт предложений
{
    int t_sentences = 0;
    foreach (char c in s)
    {
        if (c == '.') { t_sentences++; }
    }
    return $"Общее количество предложений: {t_sentences}\n";
}
string count_vow_conson(string s) // подсчёт гласных и согласных
{
    s = s.ToLower();
    string VOWELS = "аоэеиыуёюя";
    string CONSONANTS = "бвгджзйклмнпрстфхцчшщ";
    string UNREADABLE = "ьъ";
    int v_c = 0;
    int c_c = 0;
    int o_c = 0;

    foreach (char c in s)
    {
        if (VOWELS.Contains(c)) { v_c++; }
        if (CONSONANTS.Contains(c)) { c_c++; }
        if (UNREADABLE.Contains(c)) { o_c++; }
    }
    return $"Общее количество гласных: {v_c}\nОбщее количество согласных: {c_c}\nОбщее количество ь и ъ: {o_c}\n";
}
string longest_word(string s) // длиннейшее слово
{
    string res = "";
    string temp = "";
    string LETTERS = "абвгдеёжзийклмнопрстуфхцчшщэъыьюя";

    foreach (char c in s)
    {
        if (LETTERS.Contains(c))
        {
            temp += c;
        }
        else
        {
            if (temp.Length > res.Length)
            {
                res = temp;
            }
            temp = "";
        }
    }
    return $"Самое длинное слово: {res}\n";
}
string letter_stat(string s) // статистика по частоте встречаемости каждой буквы
{
    string LETTERS = "абвгдеёжзийклмнопрстуфхцчшщэъыьюя";
    string res = ""; 

    for (int i = 0; i < LETTERS.Length; i++)
    {
        int temp = 0;
        foreach (char c in s)
        {
            //++sl[c]; попробовать сделать через словари
            if (c == LETTERS[i])
            {
                temp++;
            }
        }
        res += $"В тексте {temp} букв {LETTERS[i]}.\n";
    }
    return res;
}
string statistika(string s)
{
    return $"{count_words(s)}{shortest_word(s)}{count_sentence(s)}{longest_word(s)}{count_vow_conson(s)}{letter_stat(s)}";
}
// функции, связанные с вводом текста
string text_new(string s)
{
    string text = s;
    Console.WriteLine("Введите текст:");
    s = Console.ReadLine();
    if (s.Length < 100)
    {
        Console.WriteLine("Ошибка: строка короче 100 символов");
        return text;
    }
    else
    {
        Console.WriteLine("Текст введён!");
        return s;
    }
}
string text_continue(string s)
{
    Console.WriteLine("Выберите действие:");
    Console.WriteLine("1 - вывод текста");
    Console.WriteLine("2 - дозапись");
    string m1 = Console.ReadLine();
    switch (m1)
    {
        case "1": Console.WriteLine(s); return s + "";
        case "2": return s += Console.ReadLine();
        default: Console.WriteLine("Некорректный ввод"); return s + "";
    }
}
// сохранение всей статистики в список
void save_stat(List<string> ls, string s)
{
    ls.Add(statistika(s));
    Console.WriteLine("Статистика сохранена!");
}
// возможность вывести статистику по прошлым текстам
void print_stat(List<string> ls)
{
    for (int i = 0; i < ls.Count; i++)
    {
        Console.WriteLine($"Текст {i + 1}");
        Console.WriteLine(ls[i]);
    }
}